import React from "react";

export function Dict() {

    const dict = {
        STP: "г. Санкт-Петербург",
        SVP: "г. Севастополь",
        KRM: "Крымская область",
        KAR: "Р. Карелия",
        LEN: "Ленинградская область",
        ADI: "Р. Адыгея",
        KHK: "Р. Хакасия",
        KEM: "Кемеровская область",
        TOM: "Томская область",
        TMR: "Таймырский автономный округ",
        KYA: "Красноярский край",
        VNK: "Эвенкийский автономный округ",
        SAK: "Якутская область",
        KHM: "Ханты-Мансийск автономный округ",
        SVE: "Свердловская область",
        IRK: "Иркутская область",
        UST: "Усть-Орднский автономный округ",
        ZBK: "Забакальский край",
        ABT: "Агинский-Бурятский автономный округ",
        BUR: "Р. Бурятия",
        PER: "Пермский край",
        KOM: "Р. Коми",
        UDM: "Р. Удмуртия",
        TAT: "Р. Татарстан",
        MEL: "Р. Марий-Эл",
        KIR: "Кировская область",
        CUK: "Чувашская республика",
        NIZ: "Нижегородская область",
        VLA: "Владимирская область",
        IVA: "Ивановская область",
        KOS: "Костромская область",
        YAR: "Ярославская область",
        VLG: "Вологодская область",
        BAK: "Р. Башкортостан",
        KGN: "Курганская область",
        SAM: "Самарская область",
        ULY: "Ульяновская область",
        SAR: "Саратовская область",
        PNZ: "Пензенская область",
        MOR: "Р. Мордовия",
        TAM: "Тамбовская область",
        RYA: "Рязанская область",
        TUL: "Тульская область",
        LIP: "Липецкая область",
        ORL: "Орловская область",
        AST: "Астраханская область",
        ROS: "Ростовская область",
        VGG: "Волгоградская область",
        KBB: "Кабардино-Балкарская республика",
        CEC: "Чеченская республика",
        STA: "Ставропольский край",
        KDA: "Краснодарский край",
        KHA: "Хабаровский край",
        YAN: "Ямало-Ненецкий автономный округ",
        MOW: "г. Москва",
        MOS: "Московская область",
        TVE: "Тверская область",
        NGR: "Новгородская область",
        KLU: "Калужская область",
        KGD: "Калининградская область",
        CHU: "Чукотский автономный округ",
        KAM: "Камчатский край",
        KRK: "Корякский автономный округ",
        KUI: "Курильские острова",
        SHL: "Сахалинская область",
        ARK: "Архангелская область",
        MAG: "Магаданская область",
        PRI: "Приморский край",
        YEV: "Еврейская автономная область",
        AMU: "Амурская область",
        TYV: "Р. Тыва",
        GLT: "Горно-Алтайская автономная область",
        ALT: "Алтайский край",
        NVS: "Новосибирская область",
        TYM: "Тюменская область",
        OMS: "Омская область",
        CHE: "Челябинская область",
        ORE: "Оренбургская область",
        KLM: "Р. Калмыкия",
        DAG: "Р. Дагестан",
        ING: "Р. Ингушетия",
        SEO: "Р. Северная-Осетия",
        KCR: "Карачаево-Черкесская республика",
        VOR: "Воронежская область",
        BEL: "Бельгородская область",
        KRS: "Курская область",
        BRY: "Брянская область",
        SMO: "Смоленская область",
        PSK: "Псковская область",
        MUR: "Мурманская область",
        NEN: "Ненецкий автономный округ"
    };

    const ListDict = () =>
        <ol>
            {
                Object.entries(dict)
                    .map(([key, value]) => <li key={value}>{value}</li>)
            }
        </ol>

    return (
        <div>
            <ListDict />
        </div>
    );
}

